OdDbBaseBlockRefPE.isSelfReferential(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns whether create child entity node if entity is self dependent.
\param pEntity [in] A pointer to a entity.
\returns Returns true if it is possible to create child entity node if entity is self dependent,
\otherwise returns false.

OdDbBaseBlockRefPE.isBasic(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns whether a specified block reference is a basic one.
\param pBlockRef [in] A pointer to a block reference.
\returns Returns true if the block reference is a basic one, otherwise returns false.

OdDbBaseBlockRefPE.isMInsert(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns whether a specified block reference is an array of block references (an instance of the OdMInsertBlock class).
\param pBlockRef [in] A pointer to a block reference.
\returns Returns true if the block reference is an array of block references, otherwise returns false.

OdDbBaseBlockRefPE.isGeneric(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns whether a specified block reference is generic.
\param pBlockRef [in] A pointer to a block reference.
\returns Returns true if the block reference is a generic one, otherwise returns false.
\remarks
Gs system will not process a drawable as a block reference if this method returns false.
Therefore the method can be used to filter out incompatible entities inherited from the OdDbBaseBlockRef class.

OdDbBaseBlockRefPE.isAttribute(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns whether a specified object is an attribute.
\param pAttrib [in] A pointer to an object.

OdDbBaseBlockRefPE.newAttribIterator(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Returns the newly created attribute iterator for a specified block reference.
\param pBlockRef    [in] A pointer to a block reference.
\param bSkipErased  [in] A flag that determines whether erased elements should be skipped when moving through the iterator. If the parameter value is equal to true, erased elements are skipped.

OdDbBaseBlockRefPE.blockTransform(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the transformation matrix for a specified block reference.
\param pBlockRef [in] A pointer to a block reference.

OdDbBaseBlockRefPE.blockId(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the identifier of a specified block reference.
\param pBlockRef [in] A pointer to a block reference.